In [ ]:
########################## Exploratory Data Analysis ############################

01. Pandas          (Data frame analysis)
02. Numpy           (Number Python, Math package)
03. Matplotlib      (Plotting / Graphs / Visualization)
04. Seaborn         (Plotting)
05. Plotly          (Plotting)
06. Bokhe           (Plotting)

############################ Machine Learning ################################

07. Scikit-learn    (ML models will be available)
08. Stats           (Statistics models)

############################## Deep Learning #################################

09. Tensorflow      (Developed by google)
10. Keras
11. Torch
12. Opencv          (Computer Vision)       #opencv:sentdex youtube

################################## NLP #######################################

13. NLTK            (Natural Launguage Tool Kit)
14. Scipy

############################### GenAI (LLM) ####################################
                           [Prompt Engineering]

15. ChatGPT         (is developed by openAI + Azure)
16. Makersuite      (is developed by Google)
17. Gemini          (is developed by Google)

############################### Company Based ##################################

18. Huggingface
    Transformers    (BERT models)
    DL  ML  NLP     (All tasks it will do)

19. AllenNLP

############################# Special Package ###############################

20. Random
21. Time
22. Math
23. API             (Flask)
24. UI APPS         (Streamlit)

In [ ]:
Data Analysis
ML
Deep Learning
NLP
BERT   :  Transformers  :  GPT
LLM    :  GenAI

In [ ]:
CV (Computer Vision)
Deep Learning
Read any image, video

# Reading The Data

In [1]:
# updating the file
# Im modifying the notebook

In [2]:
a=10
b=20
c=30

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# File Folder
# File name
# File path
file_location="C:\\Users\\ashux\\OneDrive\\Python Notes\\EDA\\EDA_large_data.csv"

In [6]:
pd.read_csv(file_location)

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
0,1,56,Male,49770.79,27,East,New,2,20697.08,620,No,1400
1,2,49,Female,57777.86,35,South,VIP,2,24308.49,822,No,3624
2,3,50,Female,57966.19,82,South,VIP,2,29561.40,652,Yes,9523
3,4,33,Female,59555.88,30,North,VIP,2,22868.76,503,No,244
4,5,29,Male,60871.07,14,East,New,3,31972.05,454,Yes,375
...,...,...,...,...,...,...,...,...,...,...,...,...
24995,24996,42,Male,47428.10,95,East,Returning,4,19250.61,429,No,3504
24996,24997,45,Male,73364.48,46,East,Returning,2,26113.03,555,No,148
24997,24998,60,Male,48966.95,41,South,VIP,1,5739.21,497,Yes,5832
24998,24999,30,Female,49105.76,85,South,Returning,4,9281.24,729,No,4737
24999,25000,64,Female,30118.22,52,North,Returning,1,22089.87,476,Yes,4456

- How to create a Data frame

- How to add columns 

- How to deop rows

- How to drop columns

- How to drop rows

- How to save the Dataframe

$Method-1$

**Create Dataframe using List**

In [11]:
# Step-1 : Create a Dataframe
Names=['Ramesh','Suresh','Sathish']
Age=[20,25,30]
pd.DataFrame(zip(Names,Age))

         0   1
0   Ramesh  20
1   Suresh  25
2  Sathish  30

In [17]:
#Step-2 : Update the column name
Names=['Ramesh','Suresh','Sathish']
Age=[20,25,30]
pd.DataFrame(zip(Names,Age),columns=['Names','Age'])

     Names  Age
0   Ramesh   20
1   Suresh   25
2  Sathish   30

In [23]:
#Step-3 : Update the index
Names=['Ramesh','Suresh','Sathish']
Age=[20,25,30]
df1=pd.DataFrame(zip(Names,Age),columns=['Names','Age'],index=['A','B','C'])
df1

     Names  Age
A   Ramesh   20
B   Suresh   25
C  Sathish   30

In [27]:
#Step-4 : Changing the entire column data
df1['Names']=['Sathish','Ramesh','Suresh']
df1

     Names  Age
A  Sathish   20
B   Ramesh   25
C   Suresh   30

In [31]:
#Step-6 : Adding new columns
df1['City']=['Hyd','Chennai','Mumbai']
df1

     Names  Age     City
A  Sathish   20      Hyd
B   Ramesh   25  Chennai
C   Suresh   30   Mumbai

In [41]:
#Adding a row
df1.index

Index(['A', 'B', 'C'], dtype='object')

In [114]:
#Changing the index A B C to 1 2 3
df1=pd.DataFrame(zip(Names,Age),columns=['Names','Age'],index=[0,1,2])
df1

     Names  Age
0   Ramesh   20
1   Suresh   25
2  Sathish   30

In [116]:
len(df1.index)

3

In [118]:
#Step-6 : Adding new rows (rows)
df1.loc[3]=["Alex","35"]
df1

     Names Age
0   Ramesh  20
1   Suresh  25
2  Sathish  30
3     Alex  35

In [120]:
df1.loc['A']=["Bunny",40]
df1

     Names Age
0   Ramesh  20
1   Suresh  25
2  Sathish  30
3     Alex  35
A    Bunny  40

In [122]:
#Step-7 : Drop the columns
# Before drop the column
# I will create a new column
# I have only two columns Name and AGe
# I will create a city, Then i drop the column

Name=["Ramesh","Suresh","Sathish"]
df1=pd.DataFrame(zip(Name,Age),columns=['Names','Age'],index=[0,1,2])
df1["City"]=["Hyd","Chennai","Mumbai"]
df1

     Names  Age     City
0   Ramesh   20      Hyd
1   Suresh   25  Chennai
2  Sathish   30   Mumbai

In [124]:
# Axis=1  "It reference columns"
# Axis=0  "It reference rows"
# The result you want to overwrite or save in another variable
df1.drop('City',axis=1,inplace=True)
df1

     Names  Age
0   Ramesh   20
1   Suresh   25
2  Sathish   30

In [126]:
# Step-8 : Dropping a row
df1.drop(2,inplace=True)
df1

    Names  Age
0  Ramesh   20
1  Suresh   25

In [140]:
# Step-9 : Save the df1 in your local
df1.to_csv("df1.csv",index=False)

In [142]:
pd.read_csv('df1.csv')

    Names  Age
0  Ramesh   20
1  Suresh   25

In [136]:
df1.to_csv("C:\\Users\\ashux\\OneDrive\\Documents\\df2.csv",index=False)

In [138]:
pd.read_csv("C:\\Users\\ashux\\OneDrive\\Documents\\df2.csv")

    Names  Age
0  Ramesh   20
1  Suresh   25

$Method-2$

**Create a Dataframe using dictionary**

In [146]:
d1={'Name':['Ramesh','Suresh','Sathish'],'Age':[20,25,30]}
d1

# Keys   : Consider a column name
# Values : Consider a row

{'Name': ['Ramesh', 'Suresh', 'Sathish'], 'Age': [20, 25, 30]}

In [150]:
pd.DataFrame(d1)

      Name  Age
0   Ramesh   20
1   Suresh   25
2  Sathish   30

$Method-3$

In [155]:
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [159]:
import random
even_list=[]
for i in range(5):
    num=random.randint(20,50)
    if num%2==0:
        even_list.append(num)
even_list

[50, 22, 46, 20]

In [163]:
df1['Even']=even_list
df1

   Even
0    50
1    22
2    46
3    20

In [167]:
df1['Odd']=[3,7,17,19]
df1

   Even  Odd
0    50    3
1    22    7
2    46   17
3    20   19

$head$

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

file_loc='EDA_large_data.csv'
bank_df=pd.read_csv(file_loc)

In [12]:
bank_df.head()                  # It will return top 5

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
0,1,56,Male,49770.79,27,East,New,2,20697.08,620,No,1400
1,2,49,Female,57777.86,35,South,VIP,2,24308.49,822,No,3624
2,3,50,Female,57966.19,82,South,VIP,2,29561.40,652,Yes,9523
3,4,33,Female,59555.88,30,North,VIP,2,22868.76,503,No,244
4,5,29,Male,60871.07,14,East,New,3,31972.05,454,Yes,375

In [14]:
bank_df.tail()           # It will return last 5

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
24995,24996,42,Male,47428.10,95,East,Returning,4,19250.61,429,No,3504
24996,24997,45,Male,73364.48,46,East,Returning,2,26113.03,555,No,148
24997,24998,60,Male,48966.95,41,South,VIP,1,5739.21,497,Yes,5832
24998,24999,30,Female,49105.76,85,South,Returning,4,9281.24,729,No,4737
24999,25000,64,Female,30118.22,52,North,Returning,1,22089.87,476,Yes,4456

$Shape$

In [19]:
bank_df.shape

# Shape : (m,n)  (rows, columns)
# Number of rows are 25000
# NUmber of columns are 12

(25000, 12)

In [23]:
type(bank_df.shape)

tuple

In [29]:
print("The number of rows = ",bank_df.shape[0])
print("The number of columns = ",bank_df.shape[1])

The number of rows =  25000
The number of columns =  12

$size$

In [32]:
bank_df.size        # rows * columns

300000

$len$

In [35]:
len(bank_df)

25000

$columns$

In [38]:
bank_df.columns       # It will provide all columns

Index(['ID', 'Age', 'Gender', 'Income', 'Spend_Score', 'Region',
       'Customer_Type', 'Purchase_Frequency', 'Savings', 'Credit_Score',
       'Online_Shopping', 'Loyalty_Points'],
      dtype='object')

In [42]:
cols=bank_df.columns           # It is string
cols.to_list()                 # Converting to list

['ID',
 'Age',
 'Gender',
 'Income',
 'Spend_Score',
 'Region',
 'Customer_Type',
 'Purchase_Frequency',
 'Savings',
 'Credit_Score',
 'Online_Shopping',
 'Loyalty_Points']

$dtypes$

In [50]:
bank_df.dtypes
# Object : The values under that columns are categorical
# Int/Float : The values under that columns are numerical

ID                      int64
Age                     int64
Gender                 object
Income                float64
Spend_Score             int64
Region                 object
Customer_Type          object
Purchase_Frequency      int64
Savings               float64
Credit_Score            int64
Online_Shopping        object
Loyalty_Points          int64
dtype: object

In [52]:
type(bank_df.dtypes)      # Series type

pandas.core.series.Series

$info$

In [55]:
bank_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000 entries, 0 to 24999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  25000 non-null  int64
 1   Age                 25000 non-null  int64
 2   Gender              25000 non-null  object
 3   Income              25000 non-null  float64
 4   Spend_Score         25000 non-null  int64
 5   Region              25000 non-null  object
 6   Customer_Type       25000 non-null  object
 7   Purchase_Frequency  25000 non-null  int64
 8   Savings             25000 non-null  float64
 9   Credit_Score        25000 non-null  int64
 10  Online_Shopping     25000 non-null  object
 11  Loyalty_Points      25000 non-null  int64
dtypes: float64(2), int64(6), object(4)
memory usage: 2.3+ MB

$isnull$

In [58]:
bank_df.isnull()

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
24995,False,False,False,False,False,False,False,False,False,False,False,False
24996,False,False,False,False,False,False,False,False,False,False,False,False
24997,False,False,False,False,False,False,False,False,False,False,False,False
24998,False,False,False,False,False,False,False,False,False,False,False,False
24999,False,False,False,False,False,False,False,False,False,False,False,False

In [60]:
bank_df.isnull().sum()

ID                    0
Age                   0
Gender                0
Income                0
Spend_Score           0
Region                0
Customer_Type         0
Purchase_Frequency    0
Savings               0
Credit_Score          0
Online_Shopping       0
Loyalty_Points        0
dtype: int64

- read the csv file
- head
- tail
- shape
- size
- len
- columns
- dtypes
- info
- isnull/isna

- **Not callable Error**
    - It is not a function but you provided brackets remove those brackets
- **Bound method or Built-in function Error**
    - Please provide the brackets
- **Attribute Error**
    - You provided a method which is not available
    - Please check the spelling or use dir to check the method exist or not

In [92]:
bank_df.dtypes
# I want to separate categorical columns and numerical columns
df_d=dict(bank_df.dtypes)
# for i in df_d:
#     if df_d[i]=='object':
#         print(i,df_d[i])

cat_col=[i for i in df_d if df_d[i]=='object']
num_col=[i for i in df_d if df_d[i]!='object']
print("Categorical columns = ",cat_col)
print("Numerical columns = ",num_col)

Categorical columns =  ['Gender', 'Region', 'Customer_Type', 'Online_Shopping']
Numerical columns =  ['ID', 'Age', 'Income', 'Spend_Score', 'Purchase_Frequency', 'Savings', 'Credit_Score', 'Loyalty_Points']

In [94]:
bank_df.select_dtypes(include='object').columns

Index(['Gender', 'Region', 'Customer_Type', 'Online_Shopping'], dtype='object')

In [96]:
bank_df.select_dtypes(exclude='object').columns

Index(['ID', 'Age', 'Income', 'Spend_Score', 'Purchase_Frequency', 'Savings',
       'Credit_Score', 'Loyalty_Points'],
      dtype='object')

In [98]:
# head : first 5 rows
# tail : last 5 rows

# You want some middle rows
# You want specific rows
# You want some specific columns data

$take-loc-iloc$

In [101]:
bank_df.take([1,2,3])
# By default axis=0       -----> Rows
# Provide the rows which has index=1,2,3 and all the columns

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
1,2,49,Female,57777.86,35,South,VIP,2,24308.49,822,No,3624
2,3,50,Female,57966.19,82,South,VIP,2,29561.40,652,Yes,9523
3,4,33,Female,59555.88,30,North,VIP,2,22868.76,503,No,244

In [103]:
bank_df.take([1,2,3],axis=1)

       Age  Gender    Income
0       56    Male  49770.79
1       49  Female  57777.86
2       50  Female  57966.19
3       33  Female  59555.88
4       29    Male  60871.07
...    ...     ...       ...
24995   42    Male  47428.10
24996   45    Male  73364.48
24997   60    Male  48966.95
24998   30  Female  49105.76
24999   64  Female  30118.22

[25000 rows x 3 columns]

In [107]:
bank_df.take([100,200,300])

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
100,101,30,Female,32510.40,25,West,VIP,6,27786.85,671,Yes,2070
200,201,52,Male,58819.87,30,West,Returning,7,35114.91,495,Yes,1096
300,301,27,Female,52949.07,25,North,New,3,-4165.86,836,No,7081

In [109]:
bank_df.take([100,200,300]).take([2,3],axis=1)

     Gender    Income
100  Female  32510.40
200    Male  58819.87
300  Female  52949.07

In [ ]:
bank_df.take([1,2,3])                              # Specific rows and all the columns
bank_df.take([1,2,3],axis=1)                       # Specific column and all the rows
bank_df.take([100,200,300]).take([2,3],axis=1)     # Specific rows and specific column

In [ ]:
- Read the data
- Quick checks
- type : list ==== list methods
         str  ==== string methods
         dict ==== dict methods
        index ==== has some methods but limited ==== convert into other

- head/tail/shape/size/len
- columns/dtypes/info
- categorical and numerical

- take based on axis either rows or columns (problem)

$iloc$

In [ ]:
bank_df.iloc[<rows>,<columns>]
bank_df.iloc[<start:end>,<start:end>]
bank_df.iloc[[rows index],[columns index]]

In [20]:
bank_df.iloc[5:10,2:6]
# I want select rows has index 5 to 9
# I want select columns has index 2 to 5

   Gender    Income  Spend_Score Region
5  Female  54458.83           35   East
6  Female  60843.35           34  South
7    Male  41603.15           84   East
8    Male  67645.38           15  North
9  Female  43099.04            7  South

In [30]:
bank_df.iloc[5:10,]         # All the columns and 5 to 9 index rows

,ID,Age,Gender,Income,Spend_Score,Region,Customer_Type,Purchase_Frequency,Savings,Credit_Score,Online_Shopping,Loyalty_Points
5,6,55,Female,54458.83,35,East,Returning,3,33270.24,772,No,6854
6,7,69,Female,60843.35,34,South,Returning,1,31211.60,439,No,9302
7,8,51,Male,41603.15,84,East,VIP,4,8040.37,428,Yes,9826
8,9,31,Male,67645.38,15,North,VIP,1,26293.46,670,Yes,6429
9,10,53,Female,43099.04,7,South,Returning,2,21223.98,622,Yes,2430

In [32]:
bank_df.iloc[:,:2]       # All the rows only 0 and 1 columns

          ID  Age
0          1   56
1          2   49
2          3   50
3          4   33
4          5   29
...      ...  ...
24995  24996   42
24996  24997   45
24997  24998   60
24998  24999   30
24999  25000   64

[25000 rows x 2 columns]

In [34]:
rows=[100,200,300]
cols=[2,7]
bank_df.iloc[rows,cols]

     Gender  Purchase_Frequency
100  Female                   6
200    Male                   7
300  Female                   3

In [42]:
rows=[100,200,300]
cols=['Gender','Purchase_Frequency']
bank_df.loc[rows,cols]

     Gender  Purchase_Frequency
100  Female                   6
200    Male                   7
300  Female                   3

**Note**

- iloc takes only numerical entry, we can not ptovide column names directly
- loc takes only column names